package geekbrains.lesson_1;


public class FirstApp {

    //1.Создать пустой проект в IntelliJ IDEA и прописать метод main();
    public static void main(String[] args) {
        //2.Создать переменные всех пройденных типов данных, и инициализировать их значения;
        byte g = -120;
        System.out.println(g);
        int h = 120;
        System.out.println(h);
        short j = 10000;
        System.out.println(j);
        long k = -1000;
        System.out.println(k);
        float l = 12.65f;
        System.out.println(l);
        char z ='z';
        System.out.println(z);
        boolean is = true;
        boolean isNot = false;
        String str = "Привет";
        System.out.println(str);

    }

    }


